---
type: PushButton
namespace: Autodesk.Revit.UI
version: 2024
members: 3
tags: [revit-api, class]
---

# PushButton

`Autodesk.Revit.UI.PushButton` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | AssemblyName | — | `public string AssemblyName { get ; set ; }` |
| Property | AvailabilityClassName | 2011 | `public string AvailabilityClassName { get ; set ; }` |
| Property | ClassName | — | `public string ClassName { get ; set ; }` |